maxime-filippini/bird-remote/apps/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_LV_FONT_MONTSERRAT_24=y
# Keep SPI display DMA staging chunks small enough after Wi-Fi allocates internal RAM.
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=20
# LVGL object creation and filesystem startup exceed ESP-IDF's small default.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
